{
  "backend/main.mo": "Main Motoko actor implementing water tracking backend with user-specific data storage (water entries, weight, reminders, night mode, settings), supporting daily goal management, intake logging, reminder CRUD operations, and data retrieval with migration support.",
  "backend/migration.mo": "Migration module that transforms legacy single-map dataStore structure into new multi-map architecture (waterEntries, weightEntries, reminders, nightModes, settings) while preserving all user data and adding new fields like themeMode and hasDailyGoal.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including home screen with water visualization, quick-action buttons, smart reminders system, night mode, reminder popup UI, and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the React app structure with TanStack Router, React Query hooks for backend integration, blue gradient design system, reminder management, and component implementations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Hydrate water reminder app with meta tags, favicon reference, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React app component setting up TanStack Router with routes for DrinkWater, DrinkLog, Reports, Reminders, Settings, AdvancedSettings, and HealthBenefits, wrapped in ThemeProvider with global reminder initialization and toast notifications.",
  "frontend/src/components/DrinkEntryCard.tsx": "Reusable card component displaying individual drink entry with amount in ml, formatted timestamp showing time and date, and water droplet icon with hover animations.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing gradient background with wave pattern overlay that transitions between light and dark mode color schemes.",
  "frontend/src/components/NavigationDrawer.tsx": "A navigation drawer component with a hamburger menu that displays app navigation items (Home, Drink Log, Reports, Health Benefits, Reminders, Settings) in a slide-out sheet with active route highlighting.",
  "frontend/src/components/ProgressCircle.tsx": "A circular progress indicator component that displays water intake progress with an animated SVG circle, showing current amount, goal, and percentage in the center.",
  "frontend/src/components/ReminderCard.tsx": "A card component for managing individual water reminders with time picker, day-of-week selection, sound/vibration toggles, and alert type configuration.",
  "frontend/src/components/ReminderPopup.tsx": "A dialog popup component that displays a list of water reminders with quick toggle switches and a button to navigate to full reminder settings.",
  "frontend/src/components/WaterChart.tsx": "A bar chart component using Recharts to visualize water intake data over weekly or monthly periods with theme-aware styling.",
  "frontend/src/components/WaterGlassVisualization.tsx": "An animated water glass visualization component that displays hydration progress as a filling glass with wave effects, percentage text, and decorative droplet.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context and hook for managing Internet Identity authentication, providing login/logout functionality, identity state, and authentication status tracking with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching water tracking data (progress, drink log, weight history, reports, reminders, night mode, settings) and mutations for updating goals, water intake, weight, reminders, night mode, and advanced settings. Uses a hardcoded USER_ID for offline usage.",
  "frontend/src/hooks/useReminders.ts": "Implements custom reminder logic with browser notifications, sound playback, and vibration support, respecting night mode settings. Also includes automatic hourly reminders with goal calculation based on wake/sleep times.",
  "frontend/src/index.css": "Defines global CSS styles using Tailwind with custom design tokens for light/dark themes featuring blue gradient colors, glassmorphism card styles, button variants, and wave pattern backgrounds using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdvancedSettings.tsx": "Provides UI for configuring night mode (sleep/wake times, mute reminders), reminder settings (sound, mode, missed alerts), and app preferences (units, language) with form controls and save functionality.",
  "frontend/src/pages/DrinkLog.tsx": "Displays a chronological history of water intake entries grouped by date, showing individual drink amounts and timestamps with loading states and empty state handling.",
  "frontend/src/pages/DrinkWater.tsx": "Main water tracking interface allowing users to set daily goals, log water intake with quick-add buttons, view progress visualization with a water glass component, and access reminder settings.",
  "frontend/src/pages/HealthBenefits.tsx": "Displays health benefits of hydration with icons and descriptions (digestion, concentration, immune system, skin, energy). Shows user's current hydration progress percentage with a progress bar.",
  "frontend/src/pages/Reminders.tsx": "Manages water intake reminders with add, update, and toggle functionality. Displays list of reminders using ReminderCard components with time, days of week, sound, vibration, and alert type settings.",
  "frontend/src/pages/Reports.tsx": "Shows water intake analytics with daily, weekly, and monthly summaries. Includes progress cards, charts (WaterChart component), and calculates average intake over selected time periods.",
  "frontend/src/pages/Settings.tsx": "Provides app configuration including daily water goal input, theme selection (light/dark/system), notification permissions, and unit preferences (ml). Persists settings to localStorage.",
  "frontend/src/pages/Weight.tsx": "Tracks user weight history with input form to add new weight entries. Displays historical weight records with timestamps formatted as readable dates.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including blue gradient colors, glassmorphism shadows, custom animations (shimmer, fadeIn, slideUp, waterFill, wave), and dark mode support using class strategy.",
  "project_state.json": "Project state file documenting a Water Reminder App with offline functionality, blue gradient theme, dark/light mode, AlarmManager-based reminders, and features including home screen water tracking, smart reminders, health benefits display, and statistics."
}